"""Есть список чисел: numbers = [1, 2, 3, 4, 2, 5, 6, 1, 7].
Напиши код на Python, который найдет и выведет в консоль все числа, 
которые встречаются в этом списке больше одного раза, импользуя set."""

numbers = [1, 2, 3, 4, 2, 5, 6, 1, 7]
seen = set()               # Сюда кладем всё, что увидели первый раз
duplicates = set()         # Сюда кладем только повторы

for n in numbers:
    if n in seen:
        duplicates.add(n)  # Что делать, если число УЖЕ в seen?
    else:
        seen.add(n)        # Что делать, если числа ТАМ ЕЩЕ НЕТ?
print (duplicates)