# Список чисел (исходные данные)
nums = [2, 7, 11, 15]

# Целевое значение суммы
target = 9

# ---------- ВАРИАНТ 1. Перебор всех пар (два цикла) ----------

# Внешний цикл: перебираем первый индекс i
for i in range(len(nums)):
    # Внутренний цикл: перебираем второй индекс j,
    # всегда начиная с i + 1 (чтобы не брать одну и ту же пару дважды)
    for j in range(i + 1, len(nums)):
        # Складываем два числа по индексам i и j
        addition = nums[i] + nums[j]

        # Если сумма равна target — выводим индексы
        if addition == target:
            print("Bruteforce:", i, j)

# ---------- ВАРИАНТ 2.1 Через словарь (оптимальный) ----------

# Словарь для "памяти" уже просмотренных чисел
# Ключ: число из списка
# Значение: его индекс
prev_values = {}

# enumerate даёт и индекс (i), и само число (n)
for i, n in enumerate(nums):
    # Сколько не хватает до target, если брать текущее число n
    diff = target - n

    # Если "недостающее число" diff уже было раньше,
    # оно лежит в словаре prev_values как ключ
    if diff in prev_values:
        # prev_values[diff] — индекс числа, которое мы видели раньше
        # i — индекс текущего числа n
        print("Dict:", prev_values[diff], i)
    else:
        # Если нужного числа ещё не было — запоминаем текущее
        # Ключ: само число n
        # Значение: его индекс i
        prev_values[n] = i

# Просто посмотрим, что накопилось в словаре
print("Prev values:", prev_values)

# ---------- ВАРИАНТ 2.2 Через словарь (оптимальный; все) ----------

# Словарь для "памяти" уже просмотренных чисел
# Ключ: число из списка
# Значение: его индекс
prev_values2 = {}

# enumerate даёт и индекс (i), и само число (n)
for i, n in enumerate(nums):
    # Сколько не хватает до target, если брать текущее число n
    diff = target - n

    # Если "недостающее число" diff уже было раньше,
    # оно лежит в словаре prev_values как ключ
    if diff in prev_values2:
        # prev_values[diff] — индекс числа, которое мы видели раньше
        # i — индекс текущего числа n
        print("Dict:", prev_values2[diff], i)
    prev_values2[n] = i

# Просто посмотрим, что накопилось в словаре
print("Prev values, all:", prev_values2)